tutorials/incompressible/pisoFoam/LES/motorBike/motorBike/system/stabilizationSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

residuals
{
    type            residuals;
    libs            ("libutilityFunctionObjects.so");
    writeFields     true;
    writeControl    outputTime;
    fields          (p);
}

blendingFactor
{
    type                stabilityBlendingFactor;
    libs                ("libfieldFunctionObjects.so");
    log                 true;
    writeToFile         false;

    switchNonOrtho      yes;
    switchGradCc        no;
    switchResiduals     yes;
    switchSkewness      no;
    switchFaceWeight    no;
    switchCo            no;

    maxNonOrthogonality 20;
    minNonOrthogonality 60;

    maxGradCc           3;
    minGradCc           4;

    maxResidual         100;

    P                   5;
    I                   0.01;
    D                   0.5;

    minFaceWeight       0.3;
    maxFaceWeight       0.2;

    Co1                 1;
    Co2                 2;

    maxSkewness         2;
    minSkewness         3;


    field               U;
    result              UBlendingFactor;
}

// ************************************************************************* //
